# Level Up Your Pandas Game with These 15 HiddenÂ Gems

## Setup

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)

2.2.0

## `agg`

In [2]:
data = {
    "A": [1, 2, 3, 4],
    "B": [5, 6, 7, 8],
    "C": [9, 10, 11, 12],
}

df = pd.DataFrame(data)

df.agg({"A": "sum", "B": "mean", "C": "max"})

A    10.0
B     6.5
C    12.0
dtype: float64

In [3]:
df.agg({"A": ["sum", "mean"], "B": "mean", "C": "max"})

         A    B     C
sum   10.0  NaN   NaN
mean   2.5  6.5   NaN
max    NaN  NaN  12.0

In [4]:
data = {
    "group": [1, 1, 2, 2],
    "A": [1, 2, 3, 4],
    "B": [5, 6, 7, 8],
    "C": [9, 10, 11, 12],
}

df = pd.DataFrame(data)

df.groupby("group").agg(["mean", "sum"])

         A        B         C
      mean sum mean sum  mean sum
group
1      1.5   3  5.5  11   9.5  19
2      3.5   7  7.5  15  11.5  23

In [5]:
df.groupby("group").agg(
    avg_a=("A", "mean"),
    sum_a=("A", "sum"),
    min_c=("C", "min"),
)

       avg_a  sum_a  min_c
group
1        1.5      3      9
2        3.5      7     11

## `assign`

In [6]:
df = pd.DataFrame({"Value": [10, 15, 20, 25, 30, 35]})
df.assign(value_cat=np.where(df["Value"] > 20, "high", "low"))

   Value value_cat
0     10       low
1     15       low
2     20       low
3     25      high
4     30      high
5     35      high

In [7]:
df

   Value
0     10
1     15
2     20
3     25
4     30
5     35

In [8]:
df.assign(value_cat=np.where(df["Value"] > 20, "high", "low")).groupby(
    "value_cat"
).mean()

           Value
value_cat
high        30.0
low         15.0

## `combine_first`

In [9]:
s1 = pd.Series([1, 2, np.nan, 4, np.nan, 6])
s2 = pd.Series([10, np.nan, 30, 40, np.nan, 60])

s1.combine_first(s2)

0     1.0
1     2.0
2    30.0
3     4.0
4     NaN
5     6.0
dtype: float64

In [10]:
df = pd.DataFrame(data={"s1": s1, "s2": s2})
df["s3"] = df["s1"].combine_first(df["s2"])
df

    s1    s2    s3
0  1.0  10.0   1.0
1  2.0   NaN   2.0
2  NaN  30.0  30.0
3  4.0  40.0   4.0
4  NaN   NaN   NaN
5  6.0  60.0   6.0

In [11]:
s3 = pd.Series([1, 2, 3, 4, 5, 6])
s1.combine_first(s2).combine_first(s3)

0     1.0
1     2.0
2    30.0
3     4.0
4     5.0
5     6.0
dtype: float64

## `cumsum` / `cummin` / `cummax` / `cumprod`

In [12]:
data = {
    'A': [3, 1, 2, 0.5, 5, 10],
}

df = pd.DataFrame(data)
df["cumsum"] = df["A"].cumsum()
df["cummin"] = df["A"].cummin()
df["cummax"] = df["A"].cummax()
df["cumprod"] = df["A"].cumprod()
df

      A  cumsum  cummin  cummax  cumprod
0   3.0     3.0     3.0     3.0      3.0
1   1.0     4.0     1.0     3.0      3.0
2   2.0     6.0     1.0     3.0      6.0
3   0.5     6.5     0.5     3.0      3.0
4   5.0    11.5     0.5     5.0     15.0
5  10.0    21.5     0.5    10.0    150.0

## `cut` / `qcut`

In [13]:
df = pd.DataFrame(
    {
        "name": ["Alice", "Bob", "Charlie", "Dylan", "Eve", "Frank"],
        "years_of_exp": [10, 2, 0, 5, 6, 8],
    }
)

pd.cut(df["years_of_exp"], bins=3)

0     (6.667, 10.0]
1    (-0.01, 3.333]
2    (-0.01, 3.333]
3    (3.333, 6.667]
4    (3.333, 6.667]
5     (6.667, 10.0]
Name: years_of_exp, dtype: category
Categories (3, interval[float64, right]): [(-0.01, 3.333] < (3.333, 6.667] < (6.667, 10.0]]

In [14]:
exp_bins = [0, 2, 5, 10]
pd.cut(df["years_of_exp"], bins=exp_bins)

0    (5.0, 10.0]
1     (0.0, 2.0]
2            NaN
3     (2.0, 5.0]
4    (5.0, 10.0]
5    (5.0, 10.0]
Name: years_of_exp, dtype: category
Categories (3, interval[int64, right]): [(0, 2] < (2, 5] < (5, 10]]

In [15]:
pd.cut(df["years_of_exp"], bins=exp_bins, include_lowest=True)

0      (5.0, 10.0]
1    (-0.001, 2.0]
2    (-0.001, 2.0]
3       (2.0, 5.0]
4      (5.0, 10.0]
5      (5.0, 10.0]
Name: years_of_exp, dtype: category
Categories (3, interval[float64, right]): [(-0.001, 2.0] < (2.0, 5.0] < (5.0, 10.0]]

In [16]:
exp_labels = ["Junior level", "Mid level", "Senior level"]
pd.cut(df["years_of_exp"], bins=exp_bins, include_lowest=True, labels=exp_labels)

0    Senior level
1    Junior level
2    Junior level
3       Mid level
4    Senior level
5    Senior level
Name: years_of_exp, dtype: category
Categories (3, object): ['Junior level' < 'Mid level' < 'Senior level']

In [17]:
pd.qcut(df["years_of_exp"], q=3)

0    (6.667, 10.0]
1    (-0.001, 4.0]
2    (-0.001, 4.0]
3     (4.0, 6.667]
4     (4.0, 6.667]
5    (6.667, 10.0]
Name: years_of_exp, dtype: category
Categories (3, interval[float64, right]): [(-0.001, 4.0] < (4.0, 6.667] < (6.667, 10.0]]

## `duplicated` / `drop_duplicates`

In [18]:
data = {"A": [1, 2, 2, 3, 4, 4], "B": ["x", "y", "y", "z", "w", "w"]}
df = pd.DataFrame(data)

df.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [19]:
df.duplicated(keep="last")

0    False
1     True
2    False
3    False
4     True
5    False
dtype: bool

In [20]:
df.duplicated(keep=False)

0    False
1     True
2     True
3    False
4     True
5     True
dtype: bool

In [21]:
df.drop_duplicates()

   A  B
0  1  x
1  2  y
3  3  z
4  4  w

## `isin`

In [22]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Value": [1, 1, 1, 2, 2],
}

df = pd.DataFrame(data)

selected_names = ["Alice", "David", "Eve"]
df[df["Name"].isin(selected_names)]

    Name  Value
0  Alice      1
3  David      2
4    Eve      2

In [23]:
pd.Series(["a", "b"]).isin(["a"])

0     True
1    False
dtype: bool

## `merge_ordered`

In [24]:
df1 = pd.DataFrame(
    {
        "date": pd.date_range(start="2022-01-01", periods=5)[::-1],
        "value_df1": [10, 15, 20, 25, 30],
    }
)

df2 = pd.DataFrame(
    {
        "date": pd.date_range(start="2022-01-03", periods=4)[::-1],
        "value_df2": [100, 150, 250, 300],
    }
)

pd.merge_ordered(df1, df2, on="date", fill_method="ffill")

        date  value_df1  value_df2
0 2022-01-01         30        NaN
1 2022-01-02         25        NaN
2 2022-01-03         20      300.0
3 2022-01-04         15      250.0
4 2022-01-05         10      150.0
5 2022-01-06         10      100.0

In [25]:
pd.merge(df1, df2, on="date", how="outer")

        date  value_df1  value_df2
0 2022-01-01       30.0        NaN
1 2022-01-02       25.0        NaN
2 2022-01-03       20.0      300.0
3 2022-01-04       15.0      250.0
4 2022-01-05       10.0      150.0
5 2022-01-06        NaN      100.0

## `pct_change`

In [26]:
data = {
    "date": pd.date_range(start="2022-01-01", end="2022-01-05"),
    "price": [100, 105, 98, 110, 120],
}

df = pd.DataFrame(data).set_index("date")

df["price"].pct_change()

date
2022-01-01         NaN
2022-01-02    0.050000
2022-01-03   -0.066667
2022-01-04    0.122449
2022-01-05    0.090909
Name: price, dtype: float64

## `select_dtypes`

In [27]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 22],
    "salary": [50000.0, 60000.0, 45000.0],
    "date_joined": ["2022-01-01", "2022-02-15", "2021-12-10"],
    "remote_worker": [True, False, True]
}

df = pd.DataFrame(data)

df.select_dtypes(include=["int64", "float64"])

   age   salary
0   25  50000.0
1   30  60000.0
2   22  45000.0

In [28]:
df.select_dtypes(include="number")

   age   salary
0   25  50000.0
1   30  60000.0
2   22  45000.0

In [29]:
df.select_dtypes(include="object")

      name date_joined
0    Alice  2022-01-01
1      Bob  2022-02-15
2  Charlie  2021-12-10

In [30]:
df.select_dtypes(exclude="object")

   age   salary  remote_worker
0   25  50000.0           True
1   30  60000.0          False
2   22  45000.0           True